perftests/run1.log
hey -z 30s -m GET -cpus 4 -c 200 -H "Authorization: icandowhatiwant" http://localhost:9000/performance

Summary:
  Total:	30.0052 secs
  Slowest:	0.0810 secs
  Fastest:	0.0000 secs
  Average:	0.0081 secs
  Requests/sec:	24738.0518
  
  Total data:	88325251 bytes
  Size/request:	119 bytes

Response time histogram:
  0.000 [1]	|
  0.008 [445126]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.016 [203273]	|■■■■■■■■■■■■■■■■■■
  0.024 [68672]	|■■■■■■
  0.032 [19114]	|■■
  0.041 [4670]	|
  0.049 [1051]	|
  0.057 [257]	|
  0.065 [51]	|
  0.073 [9]	|
  0.081 [5]	|


Latency distribution:
  10% in 0.0011 secs
  25% in 0.0025 secs
  50% in 0.0064 secs
  75% in 0.0116 secs
  90% in 0.0177 secs
  95% in 0.0220 secs
  99% in 0.0313 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0810 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0035 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0014 secs
  resp wait:	0.0081 secs, 0.0000 secs, 0.0810 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0015 secs

Status code distribution:
  [400]	742229 responses

Error distribution:
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50596->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50597->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50602->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50604->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50605->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50606->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50608->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50612->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50613->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50614->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50615->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50617->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50618->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50619->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50620->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50621->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50622->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50623->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50624->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50625->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50626->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50628->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50629->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50632->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50635->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50636->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50638->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50640->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50641->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50642->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50643->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50644->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50645->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50646->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50647->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50648->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50650->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50651->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50654->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50656->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50658->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:50663->127.0.0.1:9000: read: connection reset by peer